#12. б) Дан текстовий файл f. Отримати файл g, утворений з файлу f заміною всіх його
#прописних (великих) букв такими ж рядковими (малими) літерами.

#Відкриваємо спочатку файли для письма (введення даних).
f=open('12.2.text1.txt', 'w')
f.write(input('Введіть слово/речення: '))
f.close()
g=open('12.2.text2.txt', 'w')

#Ще раз відкриємо, але вже для читання написаного:
with open('12.2.text1.txt', 'r') as f: 
    lines=f.readlines()
    for i in lines:
        i=i.lower() #Перетворимо усі ВЕЛИКІ літери на малі.
        g.write(i) #Запишемо їх у файл g.

#Відкриємо файл g для прочитання.
g=open('12.2.text2.txt', 'r')
fd=g.read()
print('Елементи файлу g: ', fd) #Виведемо на екран.
